Revit 2026 API

# CircuitType Enumeration

---

An enumerated type listing all the possible circuit types.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CircuitType
```
```vb
Public Enumeration CircuitType
```
```cpp
public enum class CircuitType
```
```fsharp
type CircuitType
```

| Member name | Value | Description |
| --- | --- | --- |
| Circuit | 0 | Circuit type is circuit. |
| Space | 2 | Circuit type is space. |
| Spare | 1 | Circuit type is spare. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace